[
    {
        "title": "Pulled a \"Shania Twain\" on my cheating ex... and it drives her & AP crazy KARMA",
        "author": "ThrowayCharlieFoxtrt",
        "subreddit": "cheating_stories",
        "score": 3692,
        "url": "https://www.reddit.com/r/cheating_stories/comments/m0pwlf/pulled_a_shania_twain_on_my_cheating_ex_and_it/",
        "content": "I posted this as a comment somewhere else and someone suggested I post it here. Hope it complies with your rules.\n\nMy wife's AP was her boss, a high-income executive. So I told his wife and she divorced AP, taking him for pretty much everything. AP's ex-wife and I bonded over a mutual hatred of our ex's, so we thought it would torture them if we became a \"couple\". It did and we spent many nights laughing over their angry voicemails, emails, etc.\n\nBut after a few \"fake\" dates, it turned out we actually enjoyed spending time with each other. Fast forward a year and we moved in together. AP's ex is the \"stay at home\" stepmom/mom to our kids (my 2, her 3). My ex has to pay child support to me and her ex has to pay both alimony and child support -- so we're never getting married (and a cohabitation agreement is more than sufficient). We're happy, the kids are happy, and it completely, utterly, absolutely infuriates our ex's.\n\nAfter I and AP's ex moved in together, my wife turned up her rage a notch and made the mistake of making a threat voicemail that we used to get a protective order that put her job in jeopardy (her boss's boss and HR had a talk with her). The best part? My ex-wife and AP are no longer together.\n\nCan you say \"Karma\"?"
    },
    {
        "title": "Fiancé cheated on me with my father. 3",
        "author": "throwaway556ump",
        "subreddit": "cheating_stories",
        "score": 3327,
        "url": "https://www.reddit.com/r/cheating_stories/comments/13qcg97/fiancé_cheated_on_me_with_my_father_3/",
        "content": "Hey everyone, I'm sorry I haven't updated in a while I wish I could say I'm doing great but that would be a lie. Everything hits me in waves I go from just being numb to boiling with rage I haven't had a happy moment since I found out. Other than a few friends I don't really have anyone IRL especially since my family turned out to be s\\*\\*\\*. Quite a few things happened since I posted last (it's been about a month) so this update will tell all that's been going on. \n\nAfter my last post I decided to get the ball rolling on everything that needed to be done like getting tested, finding a therapist, moving and of course buying a new bed. I started by calling my doctor's office telling them I needed to get tested and to refer me to a therapist. I had my first appointment with a therapist two weeks ago and we decided to continue once a week. I also got tested last week but it'll be another week or so, so until I get the results cross your fingers for me. I got in touch with a real estate agent friend of mine and he sent me a ton of listings and I decided on a refurbished cabin on the outskirts of my city, I finished moving 2 days ago. \n\nWhen I finished moving, I called L's parents, when they picked up, I told them I moved out and L has still yet to pick up her things and that the landlord will start showing the apartment in a few days, so someone better pick her things up before the landlord throws it out. That must have lit a fire under them because the next day my former landlord texted me thanking me for getting the apartment emptied out. No one knows where I live now other than the friend who set me up with this place, so I know L, or my parents won't be dropping by. The only thing that sucks about this place is I traded a 10-minute walk to work to a 45-minute drive.\n\nMy phone has been blowing up with texts and calls from L, both my parents and some of my friends but I have no interest in talking to anyone other than my therapist. At work I've been a ghost I go in get my work done and leave, on the rare occasion I have to talk to someone I put on my fake smile and pretend everything is okay. My boss from my previous post has been trying to check in on me more but I don't really tell her anything either I just tell her I appreciate it, but I'll be okay. Truth is, I don't know if I'll be okay, I get that time heals and all, but I feel like that's only relevant when you're dealing with one issue not when you lose who you thought were the three closest people in your life all at once. A huge part of me died and there's no chance of resuscitating it.\n\nThe meetings with my therapist are going well I suppose I've never done therapy before, so I have no reference on what good therapy is. We do get along alright, and she really seems genuine in wanting to help. The first session was us getting to know each other and delving into what brings me to her, nothing in depth but me just telling her what happened in my own words. The second session we went a bit deeper, she asked me about the relationship I had with my parents I told her up until now it was great, we talked often and always communicated well when something was wrong and that I grew up in a great home but that all means nothing now. She asked why I cut my mother out of my life I told her she said things to me I wouldn't say to someone I despised then told her there's no way she can come back from that. At the end of our last session, I gave her the link to my page on here so she can read more about how I feel and what's going on in my head. I feel like it's easier to type things out then it is to speak it. So, if you're reading this hi doc.\n\nFor now, I'm still miserable I thought I'd be okay by now not necessarily happy but okay. I know some of is my own fault not communicating to my friends but when I think about responding to them it just seems so exhausting. I know they'll want to get together or come to my new place, but I just don't have the energy to be around them. Until I do, I'll work, go to my appointments and sit on my back deck sipping on some bottom shelf whiskey and try to enjoy this beautiful view. I haven't hunted since high school so maybe I'll take that up again now that I can hunt from my back porch.\n\nThank you all for reading this far."
    },
    {
        "title": "My ex tried to cheat. It didn't work out for him though.",
        "author": "deleted",
        "subreddit": "cheating_stories",
        "score": 3037,
        "url": "https://www.reddit.com/r/cheating_stories/comments/lmpjt5/my_ex_tried_to_cheat_it_didnt_work_out_for_him/",
        "content": "After some time my ex would sleep with his phone in his pocket - weird red flag but I never said anything. When I noticed he wouldn't even pull up his phone in front of me I knew something was up. \n\nOne night it slipped out of his sweats and I woke up with it near my legs. I was just going to put it on the charger honestly but I saw he had a bunch of notifications and messages from a dating app. \n\nMan, I wanted to slap him awake. But I didn't. \n\nSo I created a profile using a friend of mines pictures (that he never met and I had her approval). She was his type 100% and I knew he loved blue eyes. So when we matched like I knew we would, we got to chatting. We talked for about a week before I suggested meeting up. Flirting, sexual stuff. He told her (me) that he was single and lived with a friend. So I suggested him paying for a hotel room so we could f-ck. He said he would. We picked a spot.\n\nMind you I paid for everything because he was unemployed after losing his job. He drained my savings account over the year with manipulation. \"We're family, we take care of each other when we're in tough spots\" he would say whenever I told him I didn't have extra money. I paid my student loans, all bills of a one bedroom, and the food. \n\nThis boy had the ballsack to ask me for money in person. That his mom's bday was coming up and he wanted to buy her something nice. So I gave him $50. Just because it was hilarious at this point. I still think about the smile on his face in that moment. That weekend he left. Said he was going to his mom's and that he'd probably stay the night. \n\nI kissed him goodbye and told him to have a great time. Then I packed all of his stuff and left it outside. I live in a US city so it went fast. Got the locks changed. He messaged me a few times on the app- I told him I was running late bevause I wanted to \"look perfect\" but I was coming and so sorry! My friend also sent me some sexy pictures to send him that didn't fully include her face (she's a real one). I even talked him into jerking off and sending me a video. \n\nThen after making him sit until about 1am. I messaged him on the dating app a picture of his belongings being rummaged through by a homeless man. And to enjoy his stay in a hotel. As soon as my phone rang, I blocked his number and went to bed. \n\nHe was outside of my door the Monday I came home from work. Ugly crying. Begging. Telling me he was homeless and had no where to go. When I wasnt having it - he got angry per usual. Once he started grabbing and trying to get into my apartment, I called the police. Filed a restraining order because he did threaten my life (and my pets!) for putting him out. Found out he ended up moving a few hours away where his only family is - and has a job! \n\nHopefully he learned something."
    },
    {
        "title": "My fiancé cheated on me with my father.",
        "author": "throwaway556ump",
        "subreddit": "cheating_stories",
        "score": 2908,
        "url": "https://www.reddit.com/r/cheating_stories/comments/134cmw7/my_fiancé_cheated_on_me_with_my_father/",
        "content": "Me 27m, fiancé 26f call her L, my father 52m call him B, my mother 50f call her R. Like many who've had something like this happen I never thought something like this would happen to me but here we are. I've never used reddit, but I've seen stories from here on TikTok so I thought I'd give this a shot for any advice you all could give me. From listening to some other stories, you all like back story I'll try and be as clear and precise as I can, but it's only been a week so if I start to lose it during the telling of this, I'm sorry.\n\nL and I met in her freshman year of college, we were both dorm in the same building where we eventually met. We later found out we lived two towns away from each other so whenever we went home, I let her drive with me. It was only added like twenty minutes, so it was no big deal. After multiple trips and hanging out at school we started to date. I have a closeknit family as did she, so we told our families right away I had met hers plenty of times when dropping her off, but it was nothing more than an introduction and exchanging pleasantries. Both of our families excepted each other with open arms and our relationship grew. I was a year ahead of her so when I graduated, I went home where I was offered a good job with great pay. I visited her at school whenever I got the chance and whenever she came home, we would make time for each other. After she graduated, she moved in with me as both of our jobs were in the city near where we grew up. Like me she was offered a position at the company she works at now with great pay. After living together for about three years I proposed, and we have been planning our wedding since. Now onto the part your all reading for.\n\nLooking back there was plenty of things I overlooked that I just wrote off thinking my father was just trying to welcome my ex into our family. Things like my father calling her all the time and if I was around, they would just tell me they were talking about the upcoming family party or something along those lines. One time L was in the shower and her phone rang I seen it was my dad, so I answered when he realized it was me, he sounded both upset and surprised that I picked up I then asked what's up he responded that he wanted to talk to L about my mother's birthday that was in a week and after a minute we ended the call. Even typing this out now I feel like an idiot for not seeing it sooner.\n\nOn the day I found out it was like any other day L had Thursdays off, so she made breakfast for both of us. When I set out for work, she gave me a kiss and told me to have a great day. During my drive to work I realized I had forgotten some paperwork I would need for a meeting I had at 3pm. I shrugged it off and told myself I would just go home at lunch to get it. L texted me throughout the day talking about all the casual stuff a couple talks about like what do you want for dinner, I did the laundry do you want me to hang it up for you blah blah blah. I didn't think it necessary to text her I was coming home for lunch so when it came around, I just left work and went home.\n\nWhen I got home, I noticed a car that looked like my fathers in our parking lot, but I didn't think anything of it and just parked and went into our building. When I opened the door, I was met with a scene out off a movie where a man comes home early and catches his spouse cheating such a cliche. There was a trail of clothes both his and hers leading to my bedroom and the sound of faint moans echoed though my apartment. I stood at the door in utter shock my brain was a mix of rage, sadness and disgust but if you were a fly on my wall, you would see what looked like a statue I just couldn't move. When I finally snapped too, not knowing how much time had passed, I took out my phone to record, I picked up all the clothes that were on the floor and threw them into the hall of the building. After, I filmed the walk to my bedroom, the door was open I stood in the doorway filming for about a minute then flipped on the lights. They both jumped at the sudden light and looked at me and to my utter shock it was my father in the bed with her, after the initial stun my father noticed I was recording and started to panic trying to find anything to cover himself and telling me to stop recording. He found a towel and wrapped it around himself and started to walk toward me, I told him if you don't want to get hurt stop coming to me, he either didn't care or didn't hear me and reached for my phone. I hit him square on the jaw his head bounced off the door and slumped to the ground. L shrieked I aimed the camera at L and said concerned about your f\\*\\*\\* buddy but nothing to say to your fiancé? My father woke up after about a minute nap and I told them I just needed to come pick something up for work so I'm heading back now if either of you pieces of s\\*\\*\\* are here when I get back, I'll send this video to everyone you know. I ended the video looked at my dad who was still coming to and said you're dead to me you're no longer my father, but you might want to go home and talk to mom because I'll be talking to her very soon.\n\nI sat in my car for a while until one of the bosses at work called to ask where I was, I told her I was on my way back right now. When I got to her office to hand her the paperwork, I must have looked awful because she started asking what was wrong with me. I told her it was nothing and I'd be okay. I could see her scanning me up and down and she noticed some blood on my collar and stood up rushed to me and said your bleeding. I looked down and said it was my fathers, she looked confused, so I pulled out my phone and showed her the video. She watched it in it's entirety she was introduced to L a few times but never my father. She sat there silent for a moment until it finally clicked that my fiancé was cheating on me but not only was she cheating, it was with my father. She asked if there was anything she could do suggesting I take some time off, but I told her I can't go back there right now. That I just need a minute and I'd be fine for the meeting, and I have another shirt in my office. The meeting went over fine I put on a smile for everyone like nothing had happened. My boss came up to me after the meeting and asked how I could do that, but I just said I don't know and went to my office. I then came home, and I was alone for the first time in a very long time.\n\nThank you for reading, I'm sorry I carried on so much, but it was therapeutic getting everything down. I just don't know what to do I defiantly need to get the hell out of this apartment I just can't live here anymore and there's no possible way I'm sleeping in that bed. I know not only do I have to go get checked out I for std's, but I think I broke something in my hand."
    }
]